In [1]:
import pandas as pd

In [6]:
df=pd.read_csv('social_Network_Ads.csv')
df

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [7]:
df.shape

(400, 5)

In [8]:
from sklearn.model_selection import train_test_split

In [17]:
train, test =train_test_split(df,random_state=0)

In [18]:
train.shape

(300, 5)

In [19]:
test.shape

(100, 5)

In [20]:
train

      User ID  Gender   Age  EstimatedSalary  Purchased
250  15810075  Female  44.0          39000.0          0
63   15583681    Male  32.0         120000.0          1
312  15733964  Female  38.0          50000.0          0
159  15598840  Female  32.0         135000.0          1
283  15663249  Female  52.0          21000.0          1
..        ...     ...   ...              ...        ...
323  15619465  Female  48.0          30000.0          1
192  15779581    Male  29.0          43000.0          0
117  15591433    Male  36.0          52000.0          0
47   15776348  Female  27.0          54000.0          0
172  15794661  Female  26.0         118000.0          0

[300 rows x 5 columns]

In [21]:
test

      User ID  Gender   Age  EstimatedSalary  Purchased
132  15725660    Male  30.0          87000.0          0
309  15652400  Female  38.0          50000.0          0
341  15776844    Male  35.0          75000.0          0
196  15738448  Female  30.0          79000.0          0
246  15638003  Female  35.0          50000.0          0
..        ...     ...   ...              ...        ...
146  15750839  Female  27.0          96000.0          1
135  15578006    Male  23.0          63000.0          0
390  15807837    Male  48.0          33000.0          1
264  15600379    Male  48.0          90000.0          1
364  15654456    Male  42.0         104000.0          1

[100 rows x 5 columns]

In [23]:
train, test =train_test_split(df,random_state=0,test_size=0.20)

In [25]:
train.shape

(320, 5)

In [27]:
test.shape

(80, 5)

In [34]:
train, test =train_test_split(df,random_state=0,train_size=0.65)

In [35]:
train.shape

(260, 5)

In [36]:
test.shape

(140, 5)

In [38]:
df

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [40]:
x=df[['Age','EstimatedSalary']]
y=df['Purchased']

In [41]:
x.shape

(400, 2)

In [42]:
y.shape

(400,)

In [43]:
x_train,y_train,x_test,y_test=train_test_split(x,y,random_state=0)

In [44]:
x_train.shape

(300, 2)

In [46]:
y_train.shape

(100, 2)

In [49]:
x_test.shape

(300,)

In [51]:
y_test.shape

(100,)